I'll include here a step-by-step. Creating a new SQ **without** the service account then changing the SQ to use a **new** service account.
This is the tf code:
```
resource "google_bigquery_data_transfer_config" "temp_query" {
  depends_on             = [google_service_account.sa_bq_usage_queries]
  display_name           = "Temp Scheduled Query to test owner change"
  location               = "US"
  data_source_id         = "scheduled_query"
  schedule               = "every 15 minutes"
  destination_dataset_id = "junk"
  email_preferences {
    enable_failure_email = true
  }
  params = {
    destination_table_name_template = "can_be_deleted"
    write_disposition               = "WRITE_APPEND"
    query                           = <<EOT
        select current_timestamp() as result
        EOT
  }
}

resource "google_service_account" "sa_bq_usage_queries" {
  account_id   = "bq-sq-user"
  display_name = "BigQuery SQ service account"
  description  = "Service account being used to execute schedule queries."
}

resource "google_project_iam_member" "data_editor" {
  depends_on = [google_service_account.sa_bq_usage_queries]
  project    = data.google_project.project.project_id
  role       = "roles/bigquery.dataEditor"
  member     = "serviceAccount:${google_service_account.sa_bq_usage_queries.email}"
}

resource "google_project_iam_member" "data_user" {
  depends_on = [google_service_account.sa_bq_usage_queries]
  project    = data.google_project.project.project_id
  role       = "roles/bigquery.user"
  member     = "serviceAccount:${google_service_account.sa_bq_usage_queries.email}"
}
```

Apply:
```
data.google_project.project: Reading...
data.google_project.project: Read complete after 2s [id=projects/xxxxxx]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_data_transfer_config.temp_query will be created
  + resource "google_bigquery_data_transfer_config" "temp_query" {
      + data_source_id         = "scheduled_query"
      + destination_dataset_id = "junk"
      + display_name           = "Temp Scheduled Query to test owner change"
      + id                     = (known after apply)
      + location               = "US"
      + name                   = (known after apply)
      + params                 = {
          + "destination_table_name_template" = "can_be_deleted"
          + "query"                           = <<-EOT
                        select current_timestamp() as result
            EOT
          + "write_disposition"               = "WRITE_APPEND"
        }
      + project                = (known after apply)
      + schedule               = "every 15 minutes"

      + email_preferences {
          + enable_failure_email = true
        }
    }

  # google_project_iam_member.data_editor will be created
  + resource "google_project_iam_member" "data_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "xxxxxx"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.data_user will be created
  + resource "google_project_iam_member" "data_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "xxxxxx"
      + role    = "roles/bigquery.user"
    }

  # google_service_account.sa_bq_usage_queries will be created
  + resource "google_service_account" "sa_bq_usage_queries" {
      + account_id   = "bq-sq-user"
      + description  = "Service account being used to execute schedule queries."
      + disabled     = false
      + display_name = "BigQuery SQ service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_service_account.sa_bq_usage_queries: Creating...
google_service_account.sa_bq_usage_queries: Creation complete after 2s [id=projects/xxxxxx/serviceAccounts/bq-sq-user@xxxxxx.iam.gserviceaccount.com]
google_project_iam_member.data_user: Creating...
google_project_iam_member.data_editor: Creating...
google_bigquery_data_transfer_config.temp_query: Creating...
google_bigquery_data_transfer_config.temp_query: Creation complete after 1s [id=projects/xxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c]
google_project_iam_member.data_editor: Creation complete after 9s [id=xxxxxx/roles/bigquery.dataEditor/serviceAccount:bq-sq-user@xxxxxx.iam.gserviceaccount.com]
google_project_iam_member.data_user: Creation complete after 10s [id=xxxxxx/roles/bigquery.user/serviceAccount:bq-sq-user@xxxxxx.iam.gserviceaccount.com]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

Get the SQ info using the API:
```
{
  "name": "projects/xxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c",
  "destinationDatasetId": "junk",
  "displayName": "Temp Scheduled Query to test owner change",
  "updateTime": "2023-06-29T14:32:51.408203Z",
  "dataSourceId": "scheduled_query",
  "schedule": "every 15 minutes",
  "nextRunTime": "2023-06-29T14:47:00Z",
  "params": {
    "write_disposition": "WRITE_APPEND",
    "query": "        select current_timestamp() as result\n",
    "destination_table_name_template": "can_be_deleted"
  },
  "state": "SUCCEEDED",
  "userId": "1010145876825293985",
  "datasetRegion": "us",
  "emailPreferences": {
    "enableFailureEmail": true
  },
  "ownerInfo": {
    "email": "giuliano@xxxxx.com"
  }
}
```

Now including the `service_account_name` attribute.

```
service_account_name   = google_service_account.sa_bq_usage_queries.email
```

Apply:

```
data.google_project.project: Reading...
google_service_account.sa_bq_usage_queries: Refreshing state... [id=projects/xxxxxx/serviceAccounts/bq-sq-user@xxxxxx.iam.gserviceaccount.com]
google_bigquery_data_transfer_config.temp_query: Refreshing state... [id=projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c]
data.google_project.project: Read complete after 1s [id=projects/xxxxxx]
google_project_iam_member.data_user: Refreshing state... [id=xxxxxx/roles/bigquery.user/serviceAccount:bq-sq-user@xxxxxx.iam.gserviceaccount.com]
google_project_iam_member.data_editor: Refreshing state... [id=xxxxxx/roles/bigquery.dataEditor/serviceAccount:bq-sq-user@xxxxxx.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_bigquery_data_transfer_config.temp_query will be updated in-place
  ~ resource "google_bigquery_data_transfer_config" "temp_query" {
        id                       = "projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c"
        name                     = "projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c"
      + service_account_name     = "bq-sq-user@xxxxxx.iam.gserviceaccount.com"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
google_bigquery_data_transfer_config.temp_query: Modifying... [id=projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c]
google_bigquery_data_transfer_config.temp_query: Modifications complete after 0s [id=projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```


Get the SQ information again:

```

{
  "name": "projects/xxxxxx/locations/us/transferConfigs/64d23617-0000-2bf4-b1eb-94eb2c19a79c",
  "destinationDatasetId": "junk",
  "displayName": "Temp Scheduled Query to test owner change",
  "updateTime": "2023-06-29T14:35:19.239547Z",
  "dataSourceId": "scheduled_query",
  "schedule": "every 15 minutes",
  "nextRunTime": "2023-06-29T14:47:00Z",
  "params": {
    "destination_table_name_template": "can_be_deleted",
    "query": "        select current_timestamp() as result\n",
    "write_disposition": "WRITE_APPEND"
  },
  "state": "SUCCEEDED",
  "userId": "1010145876825293985",
  "datasetRegion": "us",
  "emailPreferences": {
    "enableFailureEmail": true
  },
  "ownerInfo": {
    "email": "giuliano@xxx.com"
  }
}
```

Email still the same.

If you want some screenshots or other logs, let me know.